import { FaBaby, FaChair, FaHeartbeat, FaLaptop, FaPenAlt, FaShopware, FaTshirt, FaWrench } from "react-icons/fa";
import { GiCampingTent, GiFlowerPot } from "react-icons/gi";


export const dataCategories = [
    {   
        category:'کالاهای دیجیتال',
        icon:<FaLaptop/>,
        content:[
            ["لوازم جانبی گوشی", "کیف و کاور گوشی", "پاوربانک", "پایه نگهدارنده گوشی", "گوشی موبایل", "سامسونگ", "هوآوی", "اپل", "شیائومی", "آنر", "نوکیا", "واقعیت مجازی", "مچ‌بند و ساعت هوشمند"],
            ["هدفون، هدست، هندزفری", "اسپیکر بلوتوث و با سیم", "هارد، فلش و SSD", "دوربین", "دوربین عکاسی دیجیتال", "دوربین‌ ورزشی و فیلم برداری", "دوربین‌ چاپ سریع", "لوازم جانبی دوربین", "لنز", "کیف", "کارت حافظه", "کاغذ چاپ عکس", "دوربین دو چشمی و شکاری"],
            ["تلسکوپ", "پلی استیشن، ایکس باکس و بازی", "کامپیوتر و تجهیزات جانبی", "تجهیزات مخصوص بازی", "مانیتور", "کیس‌های اسمبل شده", "قطعات داخلی کامپیوتر", "ماوس", "کیبورد", "لپ تاپ", "لوازم جانبی لپ تاپ", "کیف، کوله و کاور", "کابل‌ صدا، AUX و HDMI"],
            ["تبلت", "شارژر تبلت و موبایل", "کیف، کاور، لوازم جانبی تبلت", "باتری", "دوربین‌های تحت شبکه", "مودم و تجهیزات شبکه", "ماشین های اداری", "تلفن، بی سیم و سانترال", "فکس", "پرینتر", "لوازم جانبی اداری", "کتابخوان فیدیبوک", "کارت هدیه خرید از دیجی‌کالا"]
        ],
        title:'همه دسته بندی های کالا های دیجیتال'

    },{
        category:'خودرو,ابزار و تجهیزات صنعنی',
        icon:<FaWrench/>,
        content:[
            ["خودروهای ایرانی و خارجی", "موتور سیکلت", "لوازم جانبی خودرو و موتورسیکلت", "لوازم تزیینی", "سیستم صوتی و تصویری", "نظافت و نگهداری خودرو", "کلاه کاسکت و لوازم جانبی موتور", "لوازم یدکی خودرو و موتورسیکلت", "دیسک و صفحه کلاچ", "جلوبندی و تعلیق", "چراغ خودرو", "تسمه خودرو", "کمک فنر"],
            ["لوازم مصرفی خودرو و موتورسیکلت", "لاستیک و تایر", "لنت ترمز", "روغن موتور و ضد یخ", "مکمل سوخت و روغن و انواع فیلتر", "ابزار برقی", "دریل، پیچ گوشتی برقی و شارژی", "فرز و سنگ رومیزی", "موتور برق", "مکنده و دمنده", "کارواش", "کمپرسور و جک خودرو", "ابزار همه کاره برقی و شارژی"],
            ["ابزار غیر برقی", "ابزار دستی", "مجموعه ابزار", "نردبان", "پیچ گوشتی و فازمتر", "نظم دهنده ابزار", "متر، تراز، اندازه‌گیری دقیق", "لوازم روانکاری", "چسب صنعتی", "لوازم و یراق آلات ساختمانی", "شیرآلات", "رنگ", "دستگیره در"],
            ["لوازم باغبانی", "قیچی‌، چاقو و ابزار باغبانی", "بذر و تخم گیاهان", "تبر، بیل و کلنگ", "خاک، کود و آفت کش", "نور و روشنایی", "لوسترو آباژور", "لامپ", "چندراهی برق و محافظ ولتاژ", "تجهیزات ایمنی و کار", "کفش ایمنی", "حفاظتی و امنیتی", "گاوصندوق"]
        ],
        title:'همه دسته‌بندی‌های وسایل نقلیه و صنعتی'
    },
    {
        category:'مد و پوشاک',
        icon:<FaTshirt/>,
        content:[
            ["مردانه", "لباس مردانه", "تی شرت و پولو شرت", "پیراهن", "شلوار", "لباس زیر", "کفش مردانه", "کفش روزمره", "کفش رسمی", "اکسسوری مردانه", "ساعت", "کیف", "کمربند"],
            ["زنانه", "لباس زنانه", "پوشش اسلامی و مانتو", "بلوز و شومیز", "تی شرت و پولوشرت", "شلوار و سرهمی", "لباس زیر", "کفش زنانه", "کفش روزمره", "کفش تخت", "اکسسوری زنانه", "ساعت", "کیف"],
            ["شال و روسری", "زیورآلات زنانه", "دستبند", "گوشواره", "گردنبند", "زیورآلات طلا زنانه", "دستبند", "گوشواره", "آویز", "گردنبند", "زیورآلات نقره زنانه", "عینک آفتابی زنانه", "عینک آفتابی مردانه"],
            ["پوشاک ورزشی مردانه", "پوشاک ورزشی زنانه", "کفش ورزشی مردانه", "کفش ورزشی زنانه", "پوشاک ورزشی پسرانه", "پوشاک ورزشی دخترانه", "کفش ورزشی پسرانه", "کفش ورزشی دخترانه", "کوله پشتی مردانه", "بچه گانه", "نوزاد", "پسرانه", "دخترانه"]
        ],
        title:'همه دسته‌بندی‌های مد و پوشاک'
    },{
        category:'اسباب بازی,کودک و نوزاد',
        icon:<FaBaby/>,
        content:[
            ["بهداشت و حمام کودک و نوزاد", "پوشک", "دستمال مرطوب", "حوله", "وان حمام نوزاد", "مینی واش", "شامپو کودک و نوزاد", "پوشاک و کفش کودک و نوزاد", "لباس کودک و لباس نوزادی", "کفش", "کفش ورزشی", "جوراب و پاپوش کودک و نوزاد", "کلاه و پیشبند نوزاد"],
            ["تبلت", "XBox, PS4 و بازی", "اسباب بازی", "فکری و آموزشی", "پازل، لگو و ساختنی", "عروسک و فیگور", "اسپینر، ابزار شوخی و سرگرمی", "تفنگ، تیر و لوازم بازی جنگی", "بازی و سرگرمی کودک", "ماشین بازی، موتور، سه چرخه", "دوچرخه", "تشک بازی و پارک بازی", "تاب و سرسره"],
            ["سلامت، ایمنی و مراقبت", "تصفیه هوا", "ترازو", "دوربین و پیجر اتاق کودک", "تب سنج و دماسنج", "محافظ و ابزار ایمنی", "خواب کودک", "مبلمان اتاق کودک", "چراغ خواب کودک", "تشک کودک", "سرویس خواب", "پتو", "بالش شیردهی"],
            ["ملزومات گردش و سفر", "کالسکه و کریر", "صندلی خودرو کودک و نوزاد", "ساک لوازم نوزاد", "لوازم جانبی گردش و سفر", "آغوشی", "لوازم شخصی", "پستانک و ملزومات", "شیردوش", "شورت آموزشی", "غذاخوری", "صندلی غذاخوری", "شیشه شیر، سرلاک، داروخوری"]
        ],
        title:'همه دسته‌بندی‌های اسباب بازی و کودک'
    },{
        category:'کالاهای سوپرمارکتی',
        icon:<FaShopware/>,
        content:[
            ["کالای اساسی و خوار و بار", "نان", "برنج", "روغن", "قند", "شکر", "سس", "رب و کنسرو گوجه", "خیارشور و ترشیجات", "آبلیمو، آبغوره و سرکه", "ماکارونی، پاستا و رشته", "زعفران، زرشک و تزیینات غذا", "حبوبات و سویا"],
            ["صبحانه", "مربا", "عسل", "حلواشکری، ارده و کنجد", "مواد پروتئینی", "سوسیس و کالباس", "گوشت گوسفندی", "گوشت مرغ", "تخم مرغ", "گوشت گاو و گوساله", "میگو", "ماهی", "تن ماهی"],
            ["لبنیات", "شیر", "ماست", "پنیر", "خامه", "نوشیدنی ها", "چای", "دمنوش", "قهوه", "آب و آب معدنی", "ماءالشعیر", "نوشابه", "شربت و آبمیوه"],
            ["میوه و سبزی", "غذای آماده و نودل", "فرآورده‌های منجمد", "کنسرو و کمپوت", "تنقلات", "شکلات، تافی و آبنبات", "بیسکویت و ویفر", "مغز طعم‌دار خشکبار", "کیک و کلوچه", "چیپس و پاپ کورن", "پفک و اسنک", "آدامس و خوشبوکننده", "خشکبار و شیرینی"]
        ],
        title:'همه دسته‌بندی‌های کالاهای سوپرمارکتی'
    }
    ,{
        category:'زیبایی و سلامت',
        icon:<FaHeartbeat/>,
        content:[
            ["لوازم آرایشی", "آرایش چشم و ابرو", "آرایش لب", "آرایش صورت", "مواد آرایش مو", "سنگ پا، بهداشت و زیبایی ناخن", "تجهیزات جانبی آرایشی", "لوازم بهداشتی", "کرم و مراقبت پوست", "شامپو و مراقبت مو", "بهداشت دهان و دندان", "بهداشت و مراقبت بدن", "ضد تعریق"],
            ["لوازم شخصی برقی", "ماشین اصلاح صورت", "ماشین اصلاح سر", "سشوار", "اصلاح بدن آقایان", "اصلاح بدن بانوان", "اصلاح موی گوش، بینی و ابرو", "برس پاک سازی", "اتو مو و حالت دهنده", "بیگودی و فر کننده", "مسواک برقی", "لیزر", "ست هدیه"],
            ["عطر، ادکلن، اسپری و ست", "مردانه", "زنانه", "جیبی", "اسپری", "طلا، نقره و زیورآلات زنانه", "زیورآلات نقره زنانه", "زیورآلات طلا زنانه", "حلقه و انگشتر طلای زنانه", "دستبند طلا زنانه", "گردنبند طلا زنانه", "گوشواره طلا زنانه", "زیورآلات نقره مردانه"],
            ["ابزار سلامت و طبی", "مچ بند و ساعت هوشمند", "ترازو", "کالای خواب و استراحت طبی", "تست قند خون", "تب سنج", "فشارسنج", "ابزار مراقبت پا", "نمایشگر ضربان قلب", "ماساژور", "تشک و پتوی برقی", "ویلچر"]
        ],
        title:'همه دسته‌بندی‌های آرایشی و بهداشتی'
    },{
        category:'خانه و اشپزخانه',
        icon:<FaChair/>,
        content:[
            ["صوتی و تصویری", "تلویزیون", "سینمای خانگی و ساندبار", "گیرنده دیجیتال تلویزیون", "دکوراتیو", "مبلمان خانگی", "دکوراسیون اداری", "آینه", "پرده", "تابلو", "ساعت دیواری و رومیزی", "شمع، گل و گلدان", "فرش ماشینی، دستبافت، تابلو"],
            ["لوازم برقی خانگی", "یخچال و فریزر", "ماشین لباسشویی", "ماشین ظرفشویی", "جاروبرقی", "جارو شارژی", "تلفن، بی سیم و سانترال", "کولر، پنکه، تصفیه هوا", "قهوه و چای ساز، آب میوه گیر", "ترازوی آشپزخانه", "اتو بخار و پرسی", "حیوانات خانگی، غذا و لوازم", "آکواریوم، غذا و لوازم آبزیان"],
            ["سرو و پذیرایی", "سرویس غذاخوری", "قاشق، چنگال و کارد", "پارچ، بطری، لیوان و ماگ", "ظروف پذیرایی", "نور و روشنایی", "لامپ، چراغ و ریسه", "لوستر و چراغ تزیینی", "آشپزخانه", "سرویس و ظروف پخت و پز", "فلاسک و کلمن", "کتری، قوری، لوازم سرو چای", "ظروف یکبار مصرف"],
            ["مواد شوینده", "شوینده ظروف", "شوینده لباس", "تمیزکننده سطوح", "دستمال کاغذی", "ملحفه، سرویس، لوازم خواب", "حوله و وسایل حمام", "پادری، کمد، لوازم اتاق خواب", "لوازم دستشویی و روشویی", "فندک و لوازم جانبی", "گُل، خاک، کود، لوازم باغبانی"]
        ],
        title:'همه دسته‌بندی‌های خانه، آشپزخانه و ابزار'
    },{
        category:'کتاب,لوازم تحریر و هنر',
        icon:<FaPenAlt/>,
        content:[
            ["کتاب و مجله", "کتاب چاپی", "مجلات خارجی و داخلی", "کتاب صوتی", "محتوای آموزشی", "آموزش موسیقی", "آموزش ورزش و سرگرمی", "آموزش زبان", "آموزش نرم افزار و کامپیوتر", "نرم افزار", "بازی کنسول و کامپیوتر", "فیلم سینمایی، سریال و مستند", "آلبوم موسیقی"],
            ["لوازم التحریر", "لوازم اداری و اقلام مصرفی", "کیف، کوله پشتی و جامدادی", "چراغ مطالعه", "کاغذ کادو، پاکت و کارت هدیه", "نوشت افزار", "دفتر و کاغذ", "خودکار و روان نویس", "ابزار نقاشی و رنگ آمیزی", "میز تحریر", "آلبوم عکس", "کاغذ چاپ و پرینتر", "مداد و مداد رنگی"],
            ["آلات موسیقی", "لوازم جانبی ادوات موسیقی", "گیتار", "کیبورد و ارگ", "پیانو دیجیتال", "درام، پرکاشن و دف", "تجهیزات استودیویی", "ویولن", "سازهای ایرانی", "فرش ماشینی، دستبافت، تابلو", "فرش ماشینی", "فرش دستباف", "تابلو فرش"],
            ["صنایع دستی", "کالاهای مسی", "سفال، سرامیک و چینی", "کیف چرمی", "ترمه،‌ قلمکار و دستبافت", "خاتم، منبت، حصیری و چوبی", "تابلو و ساعت", "میناکاری", "فیروزه کوبی", "سوزن دوزی", "محصولات استخوانی", "جعبه و دست سازه های هنری"]
        ],
        title:'همه دسته‌بندی‌های کتاب، لوازم تحریر و هنر'
    },{
        category:'ورزش و سفر',
        icon:<GiCampingTent/>,
        content:[
            ["پوشاک ورزشی مردانه", "پوشاک ورزشی زنانه", "کفش ورزشی مردانه", "کفش ورزشی زنانه", "پوشاک ورزشی پسرانه", "پوشاک ورزشی دخترانه", "کفش ورزشی پسرانه", "کفش ورزشی دخترانه", "تجهیزات سفر", "چمدان و ساک", "کیف و کوله پشتی", "دوچرخه", "لوازم جانبی دوچرخه"],
            ["کوهنوردی و کمپینگ", "کفش کوهنوردی", "عصای کوهنوردی", "چراغ قوه و چراغ پیشانی", "چاقو و ابزار چند کاره", "قمقمه و فلاسک", "چادر", "کیسه خواب", "زیرانداز سفری", "لوازم جانبی کوهنوردی و سفر", "چتر", "ساک ورزشی", "قمقمه و شیکر"],
            ["لوازم ورزشی", "ورزش های هوازی و بدنسازی", "تجهیزات جانبی ایروبیک و تناسب اندام", "دمبل", "طناب", "بارفیکس", "تردمیل", "لوازم پوششی و محافظتی ورزشی", "ورزش های توپی", "توپ", "راکت", "ورزش‌های آبی", "ورزش‌های رزمی"],
            ["اسکوتر برقی", "اسکیت و اسکوتر"]
        ],
        title:'همه دسته‌بندی‌های ورزش و سفر'
    },{
        category:'محصولات بومی محلی',
        icon:<GiFlowerPot/>,
        content:[
            ["خوراکی‌های بومی محلی", "حلوا شکری، ارده و کنجد", "خرمای محلی", "عسل محلی", "عرقیات و گلاب اصیل", "ادویه و چاشنی محلی", "چای محلی", "زعفران، زرشک و تزئینات غذا", "سبزی خشک محلی", "حبوبات و سویا محلی", "قند و نبات محلی", "ماهی تازه", "روغن محلی"],
            ["خانه و کاشانه بومی محلی", "ظروف سنتی", "کاسه و کاسه بشقاب سنتی", "بشقاب سنتی", "پارچ سنتی", "لیوان سنتی", "قندان سنتی", "دیگ و قابلمه سنتی", "شکلات خوری دست‌ساز", "ابزار آشپزخانه سنتی", "دیس و سینی سنتی", "تخته سرو سنتی", "سبد دستبافت سنتی"],
            ["دکوراتیو سنتی", "آویز سرپرده سنتی", "کیس و کاور سنتی", "گلدان سنتی", "مجسمه سنتی", "چراغ خواب و آباژور", "خواب و حمام", "کوسن سنتی", "انواع قالی و قالیچه", "گلیم", "پوشیدنی‌های بومی محلی", "پوشاک بومی و محلی", "اکسسوری بومی و محلی"]
        ],
        title:'همه دسته‌بندی‌های محصولات بومی و محلی'
    }
]